{
  "id": "story_hijrah_001",
  "category": "sirah",
  "title": "Hijrah Rasulullah ﷺ",
  "subtitle": "Perjalanan Penuh Hikmah ke Madinah",
  "emoji": "🌙",
  "estimatedTime": 300,
  "paragraphs": [
    {
      "text": "Malam itu, langit Makkah terasa berbeda. Rasulullah ﷺ dan sahabatnya Abu Bakar radhiyallahu 'anhu memulai perjalanan yang akan mengubah sejarah Islam selamanya.",
      "duration": 5000
    },
    {
      "text": "Kaum musyrikin Quraisy telah merencanakan pembunuhan terhadap Rasulullah ﷺ. Mereka mengepung rumah beliau, menunggu saat yang tepat untuk menyerang.",
      "duration": 5000
    },
    {
      "text": "Namun Allah Subhanahu wa Ta'ala melindungi Rasul-Nya. Dengan izin Allah, Rasulullah ﷺ keluar dari rumah sambil membaca ayat Al-Qur'an, dan Allah menutup mata para musyrikin sehingga mereka tidak bisa melihat beliau.",
      "duration": 6000
    },
    {
      "text": "Rasulullah ﷺ dan Abu Bakar radhiyallahu 'anhu bersembunyi di Gua Tsur selama tiga hari. Gua ini terletak di selatan Makkah, jauh dari arah Madinah yang sebenarnya.",
      "duration": 5500
    },
    {
      "text": "Strategi ini sangat cerdas! Para pemburu pasti akan mengira mereka langsung menuju ke utara menuju Madinah, padahal mereka bersembunyi di arah sebaliknya.",
      "duration": 5000
    },
    {
      "text": "Selama di gua, putri Abu Bakar yang bernama Asma' radhiyallahu 'anha membawakan makanan setiap malam. Ia membelah hijabnya menjadi dua untuk mengikat bekal makanan. Karena itu, ia dijuluki 'Dzatun Nithaqain' (pemilik dua sabuk).",
      "duration": 7000
    },
    {
      "text": "Suatu saat, para pemburu Quraisy berhasil melacak jejak mereka hingga ke mulut Gua Tsur. Abu Bakar radhiyallahu 'anhu sangat khawatir dan berbisik, 'Ya Rasulullah, kalau mereka melihat ke bawah kaki mereka, mereka pasti akan melihat kita!'",
      "duration": 7000
    },
    {
      "text": "Rasulullah ﷺ dengan tenang menjawab, 'Wahai Abu Bakar, apa pendapatmu tentang dua orang yang Allah adalah yang ketiganya?' Allahu Akbar! Betapa kuatnya tawakkal Rasulullah kepada Allah!",
      "duration": 6500
    },
    {
      "text": "Allah kemudian menurunkan ayat: 'Janganlah kamu bersedih, sesungguhnya Allah beserta kita.' (QS. At-Taubah: 40)",
      "duration": 5000
    },
    {
      "text": "Momen ini mengajarkan kita bahwa ketika kita sudah berusaha maksimal (ikhtiar), maka serahkan hasilnya kepada Allah. Itulah esensi tawakkal yang sejati.",
      "duration": 6000
    },
    {
      "text": "Yang lebih menakjubkan lagi, Allah melindungi mereka dengan cara yang ajaib. Seekor laba-laba membuat sarang di mulut gua, dan sepasang burung merpati membuat sarang di dekat gua.",
      "duration": 6500
    },
    {
      "text": "Ketika para pemburu melihat sarang laba-laba dan sarang burung yang utuh, mereka berpikir, 'Mustahil ada orang di dalam gua ini. Sarangnya masih utuh!'",
      "duration": 6000
    },
    {
      "text": "Subhanallah! Allah menggunakan makhluk yang kecil dan lemah untuk melindungi Rasul-Nya. Seekor laba-laba yang bisa hancur dengan satu tiupan angin, menjadi benteng pertahanan yang kokoh dengan izin Allah.",
      "duration": 7000
    },
    {
      "text": "Setelah tiga hari, Rasulullah ﷺ dan Abu Bakar radhiyallahu 'anhu melanjutkan perjalanan ke Madinah dengan pemandu yang ahli bernama Abdullah bin Uraiqith.",
      "duration": 5500
    },
    {
      "text": "Perjalanan ini penuh tantangan. Mereka melewati jalan yang sangat sulit dan jarang dilalui orang. Tapi semua itu demi keselamatan dan masa depan Islam.",
      "duration": 6000
    },
    {
      "text": "Di tengah perjalanan, seorang pemburu ulung bernama Suraqah bin Malik mengejar mereka untuk mendapatkan hadiah dari Quraisy. Ia sangat yakin bisa menangkap Rasulullah ﷺ.",
      "duration": 6500
    },
    {
      "text": "Namun, setiap kali Suraqah mendekat, kaki kudanya terbenam dalam tanah. Ini terjadi tiga kali! Akhirnya Suraqah menyadari bahwa Muhammad ﷺ adalah benar-benar Rasul Allah.",
      "duration": 7000
    },
    {
      "text": "Yang luar biasa, Rasulullah ﷺ berkata kepada Suraqah, 'Bagaimana pendapatmu wahai Suraqah, jika nanti kamu memakai gelang Kisra (Raja Persia)?' Suraqah terkejut mendengarnya.",
      "duration": 7000
    },
    {
      "text": "Puluhan tahun kemudian, di masa Khalifah Umar bin Khattab radhiyallahu 'anhu, Persia ditaklukkan dan gelang Kisra dibawa ke Madinah. Umar radhiyallahu 'anhu memanggil Suraqah dan memakaikan gelang itu kepadanya!",
      "duration": 8000
    },
    {
      "text": "Allahu Akbar! Ini adalah bukti nyata bahwa Rasulullah ﷺ adalah benar-benar utusan Allah. Apa yang beliau kabarkan pasti terjadi, meski saat itu tampak mustahil.",
      "duration": 6500
    },
    {
      "text": "Setelah perjalanan yang melelahkan selama beberapa hari, akhirnya Rasulullah ﷺ tiba di Quba, pinggiran Madinah. Penduduk Madinah sudah menunggu dengan penuh kerinduan.",
      "duration": 6500
    },
    {
      "text": "Mereka menyambut Rasulullah ﷺ dengan menyanyikan 'Tala'al Badru 'Alaina' (Telah terbit bulan purnama atas kami). Hingga kini, lagu ini masih sering kita dengar sebagai ungkapan cinta kepada Rasulullah ﷺ.",
      "duration": 7500
    },
    {
      "text": "Di Quba, Rasulullah ﷺ membangun masjid pertama dalam Islam - Masjid Quba. Hingga kini, masjid ini tetap berdiri dan menjadi saksi sejarah hijrah yang agung.",
      "duration": 6500
    },
    {
      "text": "Kemudian Rasulullah ﷺ memasuki kota Madinah. Semua orang ingin agar Rasulullah ﷺ menginap di rumah mereka. Mereka sampai memegang tali kendali unta Rasulullah ﷺ.",
      "duration": 6500
    },
    {
      "text": "Rasulullah ﷺ bersabda dengan lemah lembut, 'Biarkanlah untaku, ia dalam perintah Allah.' Akhirnya unta itu berhenti di tanah milik dua anak yatim, dan di situlah nanti dibangun Masjid Nabawi.",
      "duration": 7500
    },
    {
      "text": "Hijrah ini bukan sekadar perpindahan geografis dari Makkah ke Madinah. Ini adalah perpindahan dari kehidupan yang penuh tekanan menjadi kehidupan yang lebih baik.",
      "duration": 6500
    },
    {
      "text": "Hijrah mengajarkan kita untuk berani meninggalkan zona nyaman ketika itu diperlukan untuk kebaikan agama kita. Kadang kita harus meninggalkan tempat, kebiasaan, atau bahkan orang-orang yang menjauhkan kita dari Allah.",
      "duration": 8000
    },
    {
      "text": "Di Madinah, Islam berkembang pesat. Dari yang dulunya hanya beberapa orang yang tersembunyi di Makkah, kini menjadi komunitas yang kuat dan terorganisir.",
      "duration": 6500
    },
    {
      "text": "Rasulullah ﷺ membangun persaudaraan antara Muhajirin (pendatang dari Makkah) dan Anshar (penduduk Madinah). Mereka berbagi harta dan tempat tinggal. Ini adalah contoh persaudaraan sejati dalam Islam!",
      "duration": 8000
    },
    {
      "text": "Bahkan, ada kisah seorang Anshar yang menawarkan setengah hartanya dan mengajukan salah satu istrinya untuk diceraikan agar saudaranya dari Muhajirin bisa menikah dengannya! Subhanallah, betapa mulianya akhlak mereka!",
      "duration": 8500
    }
  ],
  "lessons": [
    "Tawakkal kepada Allah setelah berusaha maksimal",
    "Perencanaan yang matang sangat penting (strategi Gua Tsur)",
    "Allah melindungi orang-orang yang beriman dengan cara-Nya",
    "Persahabatan sejati seperti Abu Bakar dan Rasulullah ﷺ",
    "Berani meninggalkan zona nyaman demi kebaikan agama",
    "Persaudaraan dan tolong-menolong sesama muslim"
  ]
}
